#version: 0.2 - Trained by `huggingface/tokenizers`
Ġ <
E O
EO L
Ġ )
Ġ (
Ġ i
L I
LI T
U M
N UM
Ġ =
Ġi n
Ġ [
Ġ ]
Ġ :
Ġ ,
Ġ s
Ġ a
Ġ r
i n
o r
Ġ .
Ġ f
Ġ m
Ġ +
Ġ p
Ġ -
Ġ n
Ġ d
l i
Ġf or
u t
Ġ c
p ut
Ġin put
Ġi f
Ġin t
Ġp r
in t
Ġm a
a n
g e
Ġpr int
S T
ST R
Ġa n
Ġr an
Ġ *
Ġran ge
Ġ b
Ġr e
Ġan s
Ġ e
Ġ l
Ġ x
Ġ= =
s t
Ġ Ċ
s e
Ġs p
li t
Ġsp lit
Ġ N
e n
m p
Ġ j
Ġma p
Ġd e
or t
Ġ t
Ġ+ =
n t
Ġ A
> '
' <
" <
> "
Ġ '<
l se
Ġde f
u r
Ġ "<
Ġe lse
li st
Ġi mp
Ġimp ort
Ġc o
e r
Ġ k
Ġre t
Ġs e
u m
ur n
Ġret urn
_ _
Ġs t
Ġ list
y s
p p
c t
l e
Ġ w
Ġ %
Ġs ys
Ġ y
u e
Ġ h
Ġ /
Ġ S
o n
en d
l f
Ġse lf
Ġa pp
Ġapp end
a t
Ġ >
1 0
Ġ M
Ġd p
a d
Ġ v
Ġl en
r o
i t
u nt
i on
o d
Ġ/ /
Ġre ad
Ġ* *
r e
Ġ B
in e
Ġ _
Ġf ro
Ġ T
Ġc nt
Ġfro m
a m
Ġma x
l ine
Ġ C
a l
Ġst d
Ġread line
Ġd i
Ġ g
Ġstd in
Ġan d
Ġm in
Ġ K
Ġma in
a r
Ġco unt
t h
Ġ q
o l
h i
Ġre s
Ġn um
Ġm od
ion s
Ġ< =
Ġst r
o t
o p
li f
Ġe lif
o w
hi le
Ġw hile
Ġs um
m a
! =
Ġ !=
Ġ L
Ġ X
a k
Ġf l
Ġa b
Ġma th
Ġ __
Ġ u
Ġs ort
Ġco l
Ġ H
Ġt mp
Ġ D
r ue
u l
ĠT rue
re ak
Ġb reak
Ġ- =
Ġ> =
ct ions
am e
e d
r i
Ġh e
ma in
Ġi t
Ġ W
Ġse t
Ġ or
v e
f t
n ame
Ġe x
le ctions
Ġhe a
Ġcol lections
Ġ I
: __
a c
Ġ F
e x
d a
Ġab s
Ġb i
am b
Ġl amb
Ġlamb da
d i
o unt
m e
se ct
ul t
Ġbi sect
at e
g h
O D
ĠM OD
Ġex it
0 0
o ol
gh t
Ġ z
Ġ o
in d
Ġa r
ool s
r a
c e
n um
en t
ĠF a
ĠFa lse
ol ve
q ue
Ġco nt
Ġfl o
Ġit er
2 0
a ct
Ġcont in
Ġcontin ue
Ġde que
u s
m b
v er
li m
Ġ P
i me
Ġc h
Ġp ar
Ġ R
i s
__ >'
Ġt e
00 20
i d
t ools
Ġiter tools
lim it
a g
i p
ount er
Ġn ot
i ght
ĠI N
c ur
f f
Ġn ow
e m
Ġdi st
Ġv al
ver se
Ġhea p
c d
s ion
Ġsort ed
re cur
recur sion
recursion limit
Ġset recursionlimit
Ġflo at
Ġp op
ĠC ounter
Ġl e
le ft
Ġk e
di ct
Ġf act
Ġr st
ri p
ge t
Ġrst rip
Ġg cd
Ġre verse
Ġte mp
Ġfl ag
Ġ li
Ġin d
Ġ Y
Ġj o
Ġn p
Ġr o
on e
ĠIN F
a ult
Ġhea pp
Ġjo in
a s
Ġa d
o s
Ġi s
Ġdef ault
Ġle ft
Ġf ind
Ġdefault dict
Ġheap q
u n
Ġs olve
u p
Ġp ow
ex t
Ġr ight
at ions
Ġ LI
" "
or e
Ġco mb
Ġa s
Ġ G
Ġb u
: #
e c
Ġ% =
__ >"
Ġa c
Ġpar ent
Ġc ur
Ġ op
Ġ Q
10 0
Ġi d
Ġ* =
d ge
Ġke y
a b
in g
ac k
Ġn e
at a
n d
Ġres ult
Ġar r
s um
Ġa l
i z
Ġ }
Ġ {
Ġm id
i l
c ore
od e
Ġq ue
Ġind ex
Ġt ot
Ġn ext
Ġad d
Ġro ot
Ġe num
in put
er ate
Ġpr e
Ġenum erate
Ġit em
ma x
Ġval ue
Ġid x
Ġl st
Ġ get
f s
r t
Ġd ata
Ġbu ff
Ġl ine
p y
Ġbuff er
Ġco py
Ġstr ip
Ġtot al
w er
Ġe nd
Ġ ;
iz e
ar t
o k
Ġt ime
c h
Ġor d
us h
Ġdi v
Ġac c
Ġparent s
Ġe dge
i st
as s
Ġdi c
Ġ &
Ġans wer
p l
Ġco st
p h
ec k
c ount
a st
ra y
c nt
e s
Ġfact or
Ġr a
o m
Ġres olve
Ġs core
Ġin v
Ġcomb in
is it
in v
Ġheapp ush
i m
Ġch eck
Ġst art
Ġd fs
Ġp er
i al
b er
ĠN one
m at
a se
ĠM A
Ġcombin ations
ab le
Ġ V
Ġv isit
: .
Ġp os
or d
Ġf un
Ġin f
Ġc e
Ġne w
Ġf ac
o int
Ġ U
Ġper m
Ġl s
i r
or s
Ġra w
Ġl ast
>" ""
"" "<
Ġ """<
Ġheapp op
Ġs q
Ġo ut
Ġacc um
ĠA B
:# >"
Ġc l
Ġar ray
Ġre d
Ġz ip
t er
Ġce il
ri ght
ul ate
m in
:# >'
ar d
Ġs u
Ġn x
: \
n ion
Ġl o
Ġo k
Ġst ack
Ġpr ime
ra ph
Ġvisit ed
ro up
Ġaccum ulate
Ġstr ing
l o
Ġn ode
Ġl c
Ġperm ut
Ġsq rt
e p
Ġfactor ial
v al
Ġpermut ations
Ġ E
Ġs ize
it e
Ġpop left
Ġreadline s
Ġfor mat
e l
Ġli s
al l
Ġpre v
an s
Ġpr od
s ort
u mp
Ġr ow
Ġdi ff
en s
Ġ< <
re e
an d
Ġm i
Ġ// =
Ġnum ber
u ct
up le
Ġp i
Ġvalue s
Ġlc m
e st
k e
Ġf ra
Ġque ue
Ġfun ct
pl ac
Ġprod uct
is ors
Ġnum s
Ġran d
Ġg raph
Ġfunct ools
in it
Ġn ump
ok ens
10 00
p e
Ġde c
Ġnump y
Ġfra ctions
st r
Ġcl ass
Ġcount er
Ġp l
Ġm o
ow er
ĠM I
Ġg roup
im al
Ġp at
Ġt uple
Ġm em
Ġ> >
at or
Ġx y
u ce
Ġred uce
Ġp oint
od d
Ġdi ce
m o
Ġu f
Ġt o
Ġb it
ri d
Ġitem s
g th
Ġa a
ĠD P
Ġmem o
Ġs i
Ġc um
Ġa i
' '
Ġw ord
Ġcur r
Ġs s
Ġcol or
c o
an ge
Ġfl g
er ator
Ġal l
l en
5 0
Ġc al
o ut
Ġn s
Ġf i
Ġg rid
a i
Ġu se
ĠMA X
Ġt able
ri me
a y
pp er
L ist
Ġb l
v en
u er
Ġran k
an ce
di v
t ime
se rt
h e
se t
Ġse p
at ion
Ġop en
Ġedge s
Ġu p
Ġd x
Ġma t
m od
ĠL S
:. >'
i f
Ġ Z
uer y
Ġop erator
Ġn i
plac e
Ġp ass
Ġi i
c op
:. >"
a p
Ġz er
Ġu n
ĠU nion
Ġl r
Ġdi ct
c k
cop y
Ġ ^
Ġar g
g it
Ġ odd
Ġflo or
Ġb o
f act
F ind
Ġdi s
Ġout put
Ġt op
Ġt okens
Ġd y
n s
Ġch r
i ce
ct ion
Ġc ard
Ġco m
e f
Ġde ep
ĠUnion Find
Ġt ar
if y
Ġreverse d
Ġt ree
o u
Ġs h
Ġn g
Ġab c
Ġheap ify
Ġcal c
Ġh i
ĠMA P
Ġm x
Ġdeep copy
Ġn y
t a
ir st
ind ex
c i
d ate
er s
t y
p rime
Ġsu b
Ġt r
Ġad j
Ġin p
Ġs m
Ġke ys
n e
Ġstd out
c ase
get ter
Ġre place
Ġf inv
Ġitem getter
i c
1 2
Ġlen gth
Ġm ul
Ġp a
Ġt y
Ġcurr ent
w it
Ġc an
mo ve
Ġu nion
id x
Ġuse d
ĠL ist
Ġnumber s
s core
Ġc t
Ġs y
Ġtar get
th er
Ġa t
Ġdiv isors
Ġse en
p t
Ġb ase
Ġdi git
Ġrand om
s s
e t
l s
Ġco s
ci i
Ġpat h
: ?
Ġc s
l st
Ġf irst
Ġte st
: -
Ġmin us
b le
Ġl ower
Ġse g
Ġdec imal
Ġo ther
ĠIN T
Ġm e
er ge
Ġr ad
Ġpr o
Ġas cii
b al
Ġs in
Ġb in
Ġline s
Ġs a
Ġco n
Ġma ke
Ġe ven
div isors
Ġg lo
Ġ one
Ġlo op
Ġpl us
Ġo s
Ġglo bal
Ġd d
ar ch
: +
Ġm erge
Ġu pper
Ġc c
Ġw r
e ight
el d
S ort
Ġre move
1 1
Ġs x
Ġroot s
Ġc mb
Ġm y
Ġmin j
val ue
wit h
I nt
t o
Ġdist ance
Ġq uery
ec imal
p os
ĠA s
Ġs ame
Ġt a
n ode
Ġal ph
ro w
>' ''
'' '<
i se
ow n
Ġ '''<
Ġc y
Ġlo g
one y
ĠD ecimal
re a
ĠLI ST
Ġs c
Ġrad i
s ize
Ġne g
Ġy i
b y
Ġr i
Ġr s
Ġ |
r ange
Ġ O
Ġb ef
Ġin sert
mb ers
t r
Ġradi ans
ma p
Ġwr ite
Ġn a
Ġj u
k i
Ġs r
s u
me th
s h
l ower
Ġn v
c ol
Ġdi re
ac he
ro ot
Ġnx t
1 5
Ġin pl
Ġc and
ty pe
Ġre st
Ġse q
d p
Ġm oney
c on
num ber
Ġch ar
Ġde p
Ġs l
un d
Ġr l
Ġg o
ri x
m on
ce pt
Ġst at
Ġde l
meth od
Ġt x
Ġpa ir
Ġmo ve
Ġb fs
Ġa m
Ġst ep
Ġd ay
t mp
Ġun ite
Ġzer o
Ġre m
ĠAB C
l ag
Ġw a
di st
Ġord er
b o
Ġw h
i ve
ai j
I O
fact or
Ġgroup by
Ġcard s
Ġju dge
Ġiter ate
ĠI I
t okens
Ġn j
r r
c om
Ġprime s
re s
id e
ar i
Ġc i
Ġk o
Ġh a
Ġw eight
Ġde g
c le
Ġd type
di c
Ġs w
li s
Ġtr y
Ġcum sum
it y
p oint
Ġarg s
Ġhe ight
3 0
Ġas sert
Ġx s
Ġdep th
ac h
ter n
co st
m and
Ġex cept
Ġfun c
Ġup date
o f
t e
Ġre c
Ġzer os
Ġm n
Ġappend left
Ġin it
p r
re plac
Ġdec ode
em ent
im um
Ġin sort
Ġ @
replac ement
6 4
Ġa rea
Ġpr ice
ge r
Ġn C
or k
ĠX Y
Ġn ame
Ġmo st
ar ray
e g
Ġbl ack
Ġr u
m ent
Ġcom mand
Ġb b
l d
Ġmin i
ĠA ns
ar r
Ġ- >
c ache
Ġre v
ot t
Ġl l
Ġdi f
w o
Ġhi gh
Ġme mbers
Ġfro nt
Ġlr u
lower case
Ġl a
Ġbef ore
Ġyi eld
com mon
aij o
Ġin verse
at er
Ġl ow
y es
Ġc hi
Ġe le
t able
ott om
Ġpow er
el l
Ġx x
Ġx range
ak u
Ġpat tern
int s
:? >'
Ġf o
a ge
ĠM a
Ġx i
u pper
ak e
Ġm p
me mo
at h
ar sh
is or
ut e
Ġq u
z e
Ġe n
g n
len gth
y d
f un
ĠM od
pe at
con d
Ġd en
pr int
arsh all
Ġre peat
us hi
rr or
Ġdigit s
Ġchi ld
Ġrand int
Ġt t
Ġex t
Ġc m
:- >"
:- >'
Ġb ottom
Ġg y
Ġf r
Ġp t
Ġc d
Ġt h
Ġse arch
Ġb est
Ġfact inv
Ġhe ad
:? >"
Ġd own
Ġt i
f ro
: *
:+ >"
Ġat an
Ġko ch
Ġm ed
c um
Ġmat ch
q uery
Ġd q
Ġfi b
Ġf in
re es
Ġwh ite
lo ck
ac e
Ġn n
ol l
Ġn c
di ff
:+ >'
b ble
di date
iz ation
f lag
Ġread Int
Ġch ange
Ġw ork
Ġp s
j i
Ġre main
Ġse le
in k
ol d
Ġma ze
Ġh q
: (
Ġco mp
Ġd a
er o
Ġch k
fun c
Ġh o
Ġh y
Ġdire ction
Ġdiv mod
s i
as h
Ġrow s
Ġst ate
Ġt wo
Ġran time
g ar
Ġp c
il l
Ġn m
Ġr r
E rror
Ġb c
2 00
sort ed
Ġn ex
er r
c ounter
or i
Ġse cond
ab et
pl us
Ġget N
Ġdiv isor
Ġi m
Ġb ack
Ġ lim
Ġv er
Ġc x
Ġb ool
Ġbu f
Ġmat rix
g roup
ct ed
Ġw ater
N S
st art
ĠD ice
e ve
Ġma r
ce ss
Ġs o
d ata
z ero
ar y
Ġmod e
min us
N um
in f
Ġdeg rees
Ġde b
e le
Ġ limit
Ġke ta
Ġ^ =
Ġext end
se d
re v
Ġalph a
Ġr oll
fro m
a re
h o
Ġe v
p ot
Ġpoint s
Ġt urn
ise ki
a in
b l
upper case
Ġr x
at ive
Ġro ad
Ġw i
b j
ab el
ĠA NS
Ġt ext
o ck
Ġal p
Ġalph abet
Ġ>> =
Ġbo x
Ġn o
Ġs ushi
Ġcan didate
Ġcount s
ed ge
Ġcy cle
ue ue
Ġnode s
Ġh p
o ot
ĠnC r
Ġhy pot
n ext
Ġn d
re ad
ra in
Ġl m
c ard
Ġro ute
Ġam ari
Ġcm d
p ro
ĠreadInt s
f i
Ġp y
Ġt an
u g
Ġfactor ization
1 6
Ġp x
: /
f lo
ĠL R
Ġb all
Ġtime s
Ġfi le
e ct
Ġr y
e ven
p op
ĠL F
q u
Ġc a
Ġe val
Ġa ve
ent s
Ġa list
l l
Ġn l
en ce
Ġin i
: <
Ġcost s
Ġd one
Ġl b
Ġgo al
se arch
Ġbu bble
Ġv ec
Ġne ed
ĠC o
Ġim os
Ġh an
Ġmax i
Ġp p
Ġ ys
Ġc ut
ot al
ĠMI N
ĠS I
Ġbl ue
Ġta il
d e
Ġden om
Ġmod inv
ĠMod Int
p ar
R oot
ĠS R
Ġsm all
Ġsi gn
tr ing
Ġver t
Ġl n
Ġm m
Ġn w
Ġin s
Ġsu gar
: >
Ġn b
Ġch o
st ra
i an
a ir
Ġd s
Ġmin imum
ĠLI R
g cd
Ġe s
Ġs b
Ġcol ors
ne g
Ġru iseki
Ġassert IO
Ġ ST
ve l
j k
p ow
Ġscore s
it ion
Ġt l
Ġa v
ad d
Ġc ity
Ġl t
Ġy y
3 2
Ġgy aku
c an
Ġfi eld
Ġt s
Ġm on
ri end
Ġt od
Ġd o
I T
res ult
Ġk aijo
Ġsw ap
Ġd am
Ġb lock
Ġa x
ne w
b a
Ġ/ =
su b
m an
E S
Ġe l
t est
Ġs n
ip y
Ġsc ipy
Ġro und
Ġp o
Ġstat ic
s k
u u
Ġp ut
Ġstatic method
O K
Ġg r
Ġo ver
Ġd at
Ġsi eve
Ġty p
Ġc ap
Ġsele ction
ge st
Ġf n
jk stra
di ce
Ġd ate
ke y
Ġinsert ion
: )
Ġs ol
ak o
n er
Ġl abel
Ġcon ne
ĠS S
t ack
Ġmo ji
M A
mat rix
Ġar y
Ġinput s
ĠF ind
Ġha lf
Ġsum s
ent er
Ġho ge
Ġr un
ab s
Ġr ot
Ġp print
Ġbi g
ĠS UM
Ġn h
Ġb r
g raph
Ġs k
Ġd t
ĠS tring
Ġp in
Ġre ach
Ġun it
ft er
Ġseg func
co mb
Ġex p
p ath
Ġk a
h a
I N
Ġmap int
ok i
Ġinv s
li ce
ut f
Ġx or
line s
ĠS um
Ġcheck ed
e k
ic s
Ġs ide
Ġinf o
Ġarg v
Ġi r
Ġst ock
te mp
T ree
Ġo bj
Ġf riend
Ġl ink
t ter
Ġp q
g o
Ġt ak
ord er
col or
id th
d le
Ġdi jkstra
Ġword s
factor ize
Ġn f
Ġco in
Ġmax imum
Ġp f
Ġr n
Ġv is
Ġfl ush
ĠMa x
b it
k aijo
Ġk ou
Ġstd err
D i
Ġqu it
ĠString IO
Ġ old
li p
as k
Ġ| =
Ġpar t
ĠY ES
Ġcombin ation
Ġheappush pop
t otal
st ance
ĠL LI
Ġfac inv
w ard
f ill
Ġa ct
c al
ell man
F S
ĠA A
f it
Ġt d
b ase
Ġco u
Ġxy z
in stance
Ġt he
Ġx l
Ġk i
:* >'
i g
e ger
Ġlm i
Ġco nd
Ġin int
M I
ĠI n
ok o
ist ics
Ġk k
ch eck
Ġr ate
Ġma sk
Ġle vel
Ġac os
Ġfac es
Ġz fill
Ġne i
Ġget List
Ġr m
Ġt rain
Ġbo mb
Ġstat istics
Ġr t
S um
Ġh h
y o
Ġ J
Ġs at
ge n
is h
p air
Ġi l
in ation
Ġsum A
Ġas in
Ġ on
Ġc enter
ri ce
:( >'
l g
Ġs ur
an t
p s
Ġc b
Ġan y
Ġk w
Ġv ar
Ġw arshall
ul l
i es
g le
ĠI R
Ġm b
Ġp ush
al ue
ĠD I
Ġis instance
Ġmed ian
Ġmerge Sort
Ġm ult
Ġh ist
ĠD i
u d
mp ty
I P
Ġnum ba
Ġfactor s
d ef
v isit
Ġi c
str ing
:* >"
I n
ĠQ ueue
Ġdi r
ĠZ IP
s ame
Ġw idth
dist ance
Ġnj it
Ġt ask
Ġd w
Ġta ro
Ġmax v
Ġmin v
Ġb un
flo yd
ĠCo mb
m ul
ver t
Ġb a
di git
Ġthe ta
Ġj j
Ġd h
Ġb s
Ġxy h
Ġc n
ex p
Ġflo yd
Ġb us
ing o
Ġin m
t ree
w arshall
ar se
ĠL C
Ġab cd
Ġsh ell
Ġct r
Ġlist s
ĠB C
me mbers
si ble
Ġmar k
Ġid e
Ġsh ort
A B
o us
P rime
Ġi o
Ġi pt
ĠA C
ĠC O
Ġdam age
n ow
Ġ ~
Ġc ase
t op
Ġk ind
Ġsp arse
ĠN O
Ġh ash
w ise
00 2
Ġtod o
o st
Ġh s
Ġty pe
a li
Ġin l
u ke
Ġr c
Ġm t
Ġn t
Ġe at
Ġx v
da y
Ġp e
: =
Ġdel ta
n n
ar g
C ount
p rice
Ġl on
Ġw v
ri dge
Ġpi v
wit ch
Ġele ment
g t
o se
le te
Ġin str
C D
Ġw s
Ġbit s
:( >"
ĠA i
