#version: 0.2 - Trained by `huggingface/tokenizers`
Ġ <
E O
EO L
Ġ )
Ġ (
Ġ i
L I
LI T
U M
N UM
Ġ =
Ġi n
Ġ ]
Ġ [
Ġ :
Ġ ,
Ġ s
Ġ a
Ġ r
i n
o r
Ġ .
Ġ f
Ġ m
Ġ +
Ġ p
Ġ -
l i
Ġ n
Ġ d
Ġf or
u t
Ġ c
p ut
Ġin put
Ġi f
Ġin t
Ġp r
in t
Ġm a
a n
g e
Ġpr int
S T
ST R
Ġa n
Ġr an
Ġ *
Ġran ge
Ġ b
Ġr e
Ġan s
Ġ e
Ġ l
Ġ= =
Ġ x
s t
s e
Ġs p
li t
Ġsp lit
e n
m p
Ġ j
Ġma p
Ġ N
e f
or t
Ġ t
Ġ+ =
n t
> '
' <
" <
> "
Ġ '<
l se
Ġ A
u r
Ġ "<
Ġe lse
li st
mp ort
Ġc o
e r
Ġd ef
Ġ k
Ġre t
Ġs e
u m
ur n
Ġret urn
_ _
Ġs t
Ġ list
y s
p p
c t
Ġ %
Ġs ys
Ġ w
Ġ y
u e
Ġ /
Ġi mport
o n
Ġ h
en d
l e
l f
Ġse lf
Ġa pp
Ġapp end
a t
Ġ S
Ġ >
1 0
Ġ M
Ġd p
a d
Ġ v
r o
Ġl en
i t
u nt
i on
o d
Ġ/ /
Ġre ad
Ġ* *
r e
Ġ B
in e
Ġ _
ro m
Ġ T
Ġc nt
a m
Ġma x
l ine
a l
Ġ C
Ġst d
Ġread line
Ġd i
Ġ g
Ġstd in
Ġan d
Ġm in
Ġma in
a r
Ġ K
Ġco unt
t h
Ġ q
i mport
o l
h i
Ġre s
Ġf rom
Ġn um
ion s
Ġm od
Ġ< =
Ġst r
o t
o p
li f
Ġe lif
o w
hi le
Ġs um
m a
! =
Ġ !=
Ġw hile
Ġ L
a k
Ġ X
Ġf l
Ġa b
Ġma th
Ġ __
Ġ u
Ġs ort
Ġco l
Ġt mp
Ġ D
r ue
u l
ĠT rue
re ak
Ġb reak
Ġ- =
Ġ> =
Ġ H
ct ions
am e
Ġd e
e d
r i
Ġh e
ma in
Ġi t
Ġse t
Ġ or
v e
Ġ W
n ame
Ġe x
le ctions
Ġhe a
Ġcol lections
: __
Ġ I
a c
Ġ F
ef t
e x
d a
Ġab s
Ġb i
am b
Ġl amb
Ġlamb da
d i
o unt
m e
se ct
ul t
Ġbi sect
at e
g h
O D
Ġex it
0 0
ĠM OD
o ol
gh t
Ġ z
Ġ o
in d
ool s
n um
Ġa r
r a
d ef
c e
en t
ĠF a
ĠFa lse
ol ve
q ue
Ġco nt
Ġfl o
Ġit er
2 0
a ct
Ġcont in
Ġcontin ue
f rom
Ġde que
u s
m b
v er
li m
Ġ P
i me
Ġc h
Ġp ar
i s
__ >'
Ġt e
Ġ R
00 20
i d
t ools
Ġiter tools
lim it
a g
i p
ount er
Ġn ot
i ght
c ur
f f
Ġn ow
Ġdi st
e m
ver se
Ġv al
ĠI N
Ġhea p
c d
s ion
Ġsort ed
re cur
recur sion
recursion limit
Ġset recursionlimit
Ġflo at
Ġp op
ĠC ounter
l eft
Ġk e
di ct
Ġf act
Ġr st
ri p
ge t
Ġrst rip
Ġg cd
Ġre verse
Ġte mp
Ġfl ag
Ġ li
Ġin d
Ġ Y
Ġj o
Ġn p
on e
Ġr o
a ult
ĠIN F
Ġhea pp
Ġjo in
a s
Ġa d
o s
Ġi s
Ġdef ault
Ġl eft
Ġf ind
Ġdefault dict
Ġheap q
u n
Ġs olve
u p
Ġp ow
ex t
Ġr ight
at ions
" "
Ġ LI
or e
Ġco mb
Ġa s
Ġ G
: #
Ġb u
e c
Ġ% =
__ >"
Ġa c
Ġpar ent
Ġc ur
Ġ op
10 0
Ġi d
a b
Ġ Q
Ġ* =
d ge
Ġke y
in g
ac k
in put
Ġn e
at a
n d
s um
Ġres ult
i z
Ġ }
Ġ {
Ġar r
Ġm id
i l
c ore
Ġa l
od e
Ġq ue
Ġind ex
Ġn ext
Ġad d
Ġt ot
Ġro ot
Ġe num
er ate
Ġenum erate
Ġit em
ma x
Ġval ue
Ġpr e
Ġid x
Ġ get
r t
f s
Ġl st
Ġbu ff
Ġd ata
Ġl ine
p y
Ġbuff er
Ġco py
Ġstr ip
w er
Ġtot al
Ġe nd
Ġ ;
iz e
c h
ar t
o k
us h
Ġor d
Ġt ime
Ġdi v
Ġac c
Ġparent s
Ġe dge
i st
as s
Ġdi c
Ġ &
p l
Ġans wer
c ount
Ġco st
p h
ec k
e s
c nt
a st
ra y
Ġfact or
Ġr a
o m
Ġres olve
Ġin v
Ġcomb in
is it
Ġs core
in v
Ġheapp ush
i m
Ġch eck
Ġd fs
Ġst art
Ġp er
i al
m at
b er
ĠN one
a se
Ġcombin ations
ĠM A
ab le
Ġ V
Ġv isit
t er
: .
Ġp os
or d
Ġf un
Ġc e
Ġne w
Ġin f
Ġf ac
o int
Ġ U
Ġper m
i r
or s
Ġl ast
Ġra w
Ġl s
>" ""
"" "<
Ġheapp op
Ġs q
Ġo ut
Ġacc um
:# >"
Ġre d
Ġar ray
ĠA B
Ġz ip
Ġce il
l o
ri ght
ul ate
m in
:# >'
ar d
Ġn x
Ġs u
: \
n ion
Ġl o
Ġo k
Ġst ack
ra ph
Ġpr ime
Ġvisit ed
ro up
Ġaccum ulate
Ġn ode
Ġl c
Ġsq rt
Ġperm ut
e p
Ġfactor ial
v al
Ġstr ing
Ġpermut ations
Ġ E
it e
Ġs ize
an s
Ġpop left
Ġreadline s
Ġfor mat
e l
Ġ """<
al l
Ġli s
Ġpre v
Ġpr od
s ort
u mp
Ġdi ff
en s
Ġr ow
Ġ< <
re e
an d
Ġm i
Ġ// =
u ct
up le
l ass
Ġp i
st r
Ġvalue s
e st
Ġlc m
Ġnum ber
k e
Ġf ra
Ġque ue
Ġfun ct
pl ac
Ġprod uct
is ors
Ġran d
Ġg raph
Ġfunct ools
in it
Ġn ump
ok ens
p e
10 00
Ġnum s
Ġnump y
Ġde c
Ġfra ctions
Ġcount er
Ġp l
ow er
ĠM I
im al
Ġg roup
Ġp at
Ġt uple
Ġm o
Ġm em
Ġ> >
at or
u ce
Ġred uce
m o
Ġx y
i f
Ġu f
Ġp oint
od d
Ġt o
Ġb it
ri d
Ġitem s
Ġdi ce
g th
Ġa a
ĠD P
Ġc um
Ġa i
Ġmem o
Ġs i
' '
m od
Ġcur r
c o
Ġcol or
Ġs s
Ġw ord
l en
an ge
er ator
Ġfl g
Ġal l
e t
5 0
Ġc al
o ut
Ġn s
Ġg rid
a i
Ġu se
Ġf i
L ist
ri me
pp er
a y
Ġt able
Ġb l
v en
ĠMA X
u er
t ime
Ġran k
an ce
di v
se rt
se t
Ġse p
at ion
Ġop en
Ġedge s
Ġu p
Ġd x
Ġma t
ĠL S
:. >'
Ġ Z
uer y
ac h
Ġop erator
plac e
p r
Ġp ass
Ġn i
c op
a p
:. >"
Ġs h
Ġz er
Ġi i
ĠU nion
Ġu n
Ġl r
c k
cop y
Ġ ^
Ġdi ct
g it
Ġar g
Ġ odd
Ġflo or
f act
F ind
Ġb o
Ġdi s
Ġout put
Ġt op
Ġt okens
Ġd y
n s
Ġch r
ct ion
i ce
pr int
Ġco m
Ġc ard
Ġde ep
ĠUnion Find
if y
Ġreverse d
Ġt ree
o u
Ġn g
Ġc lass
Ġt ar
Ġheap ify
Ġcal c
Ġh i
ĠMA P
Ġm x
Ġdeep copy
i i
Ġn y
d ate
ir st
ind ex
p rime
i c
er s
Ġab c
Ġsu b
t y
Ġad j
Ġs m
Ġke ys
Ġt r
Ġstd out
n e
get ter
Ġre place
Ġf inv
Ġin p
c ase
Ġitem getter
1 2
Ġm ul
Ġlen gth
Ġt y
Ġp a
w it
Ġcurr ent
l st
s core
mo ve
id x
Ġc an
Ġu nion
Ġuse d
l s
Ġc t
ĠL ist
Ġs y
th er
Ġdiv isors
Ġa t
p t
Ġnumber s
Ġse en
Ġtar get
e ight
Ġdi git
Ġrand om
Ġb ase
Ġco s
Ġc s
c ii
: ?
Ġpat h
Ġte st
: -
Ġmin us
b le
Ġf irst
Ġse g
Ġl ower
Ġdec imal
Ġo ther
er ge
s s
Ġm e
Ġr ad
Ġpr o
Ġas cii
b al
Ġs in
ĠIN T
Ġb in
Ġco n
Ġline s
Ġma ke
Ġe ven
div isors
Ġ one
Ġpl us
lo bal
Ġo s
Ġlo op
ar ch
Ġd d
Ġs a
: +
Ġm erge
Ġc c
Ġu pper
Ġw r
Ġg lobal
t a
el d
S ort
Ġre move
1 1
Ġroot s
Ġc mb
val ue
wit h
Ġmin j
w hile
I nt
t o
Ġm y
Ġdist ance
Ġq uery
ec imal
p os
ĠA s
ro w
n ode
Ġs ame
Ġt a
>' ''
'' '<
i se
ow n
Ġc y
Ġlo g
one y
Ġs x
ĠD ecimal
re a
ĠLI ST
s ize
Ġs c
Ġne g
Ġy i
Ġrad i
b y
Ġal ph
Ġr s
t r
Ġ |
r ange
Ġb ef
Ġin sert
mb ers
num ber
Ġradi ans
s h
ma p
Ġwr ite
Ġr i
Ġn a
Ġj u
s u
Ġs r
c lass
k i
me th
l ower
c ol
Ġn v
Ġdi re
ach e
ro ot
Ġnx t
Ġ O
1 5
d p
Ġin pl
Ġc and
ty pe
Ġre st
c on
t mp
Ġt h
Ġse q
Ġde p
un d
Ġm oney
m on
Ġs l
Ġr l
ri x
Ġg o
Ġch ar
ce pt
Ġst at
Ġde l
meth od
Ġt x
Ġmo ve
Ġpa ir
Ġb fs
Ġst ep
l ag
Ġa m
Ġun ite
Ġzer o
Ġre m
Ġd ay
di st
Ġw a
b o
Ġl e
re s
Ġw h
i ve
Ġord er
ai j
I O
fact or
Ġ '''<
Ġgroup by
di c
Ġiter ate
Ġju dge
ĠI I
li s
t okens
Ġn j
ro nt
r r
c om
ĠAB C
id e
Ġcard s
Ġprime s
ar i
Ġk o
Ġw eight
c le
Ġd type
Ġh a
p oint
Ġs w
Ġde g
Ġcum sum
it y
co st
Ġc i
3 0
Ġas sert
Ġarg s
ter n
Ġdep th
t e
m and
Ġx s
Ġex cept
Ġtr y
Ġfun c
o f
ar r
Ġhe ight
Ġup date
Ġre c
Ġzer os
Ġappend left
Ġm n
Ġin it
re plac
Ġdec ode
em ent
im um
Ġin sort
Ġ @
replac ement
6 4
ar ray
Ġa rea
ge r
Ġn C
or k
e g
Ġpr ice
Ġmo st
ĠX Y
Ġbl ack
l d
Ġr u
m ent
Ġb b
Ġcom mand
Ġmin i
Ġ- >
ĠA ns
Ġn ame
c ache
Ġre v
ot t
Ġdi f
w o
Ġl l
Ġme mbers
Ġf ront
Ġlr u
Ġhi gh
lower case
Ġl a
Ġyi eld
Ġbef ore
com mon
aij o
Ġin verse
at er
t able
Ġl ow
y es
Ġe le
Ġc hi
ott om
Ġpow er
el l
lo ck
Ġx range
Ġx x
ak u
a ge
Ġpat tern
me mo
int s
:? >'
len gth
ĠM a
u pper
Ġf o
Ġx i
at h
ak e
Ġm p
ar sh
is or
ut e
Ġq u
z e
f un
g n
Ġe n
y d
con d
pe at
ĠM od
Ġd en
arsh all
Ġre peat
us hi
rr or
Ġrand int
Ġdigit s
Ġt t
Ġex t
Ġchi ld
:- >"
:- >'
Ġc m
Ġb ottom
Ġg y
Ġf r
Ġp t
Ġc d
Ġse arch
Ġb est
d ata
Ġfact inv
Ġhe ad
:? >"
Ġd own
: *
Ġt i
:+ >"
Ġat an
Ġko ch
Ġm ed
c um
q uery
Ġd q
Ġmat ch
Ġf in
re es
Ġwh ite
Ġfi b
ac e
Ġn c
f lag
ol l
Ġn n
di ff
:+ >'
b ble
di date
iz ation
Ġread Int
Ġw ork
Ġch ange
Ġp s
j i
in k
Ġre main
Ġse le
ol d
Ġma ze
Ġh q
s i
: (
fun c
Ġco mp
er o
Ġch k
in f
Ġh y
Ġdire ction
Ġdiv mod
as h
Ġst ate
Ġrow s
Ġran time
Ġt wo
Ġp c
g ar
il l
Ġd a
c ounter
Ġb c
Ġr r
E rror
or i
Ġh o
2 00
sort ed
Ġn ex
er r
ab et
pl us
Ġget N
Ġse cond
Ġdiv isor
Ġn m
Ġi m
Ġb ack
I N
Ġ lim
Ġv er
Ġc x
g roup
Ġb ool
Ġc l
ar y
ct ed
Ġw ater
Ġbu f
Ġmat rix
st art
N S
e ve
ĠD ice
ce ss
Ġma r
N um
h o
z ero
Ġmod e
min us
Ġs o
e le
Ġdeg rees
Ġke ta
Ġ^ =
Ġ limit
re v
Ġext end
se d
Ġde b
a re
Ġr oll
c ard
Ġe v
p ot
b l
Ġpoint s
ise ki
a in
upper case
Ġt urn
Ġr x
at ive
b j
Ġro ad
ab el
ĠA NS
Ġ>> =
Ġs ushi
ed ge
Ġn o
Ġw i
Ġcan didate
Ġcy cle
re ad
Ġcount s
Ġbo x
ue ue
Ġnode s
o ot
Ġalph a
Ġhy pot
n ext
ĠnC r
ra in
Ġn d
Ġh p
Ġal p
Ġl m
p ro
Ġalph abet
Ġro ute
Ġam ari
ĠreadInt s
Ġp y
Ġcm d
Ġt ext
Ġt an
f lo
u g
Ġfactor ization
1 6
: /
q u
Ġp x
ĠL R
Ġfi le
e ven
e ct
Ġr y
p op
Ġb all
l l
ĠL F
Ġc a
Ġe val
Ġa ve
ent s
Ġtime s
en ce
Ġa list
ot al
M OD
: <
Ġcost s
Ġd one
Ġl b
se arch
Ġgo al
Ġbu bble
Ġv ec
Ġin i
Ġne ed
ĠC o
Ġim os
Ġh an
Ġn l
Ġmax i
Ġp p
Ġ ys
Ġc ut
p ar
ĠMI N
Ġta il
Ġbl ue
Ġden om
Ġmod inv
ĠMod Int
R oot
ĠS R
Ġa f
Ġsi gn
Ġsm all
tr ing
Ġver t
Ġm m
Ġn w
ĠS I
d e
Ġsu gar
: >
Ġl n
Ġch o
a ir
st ra
Ġin s
Ġn b
i an
g cd
Ġmin imum
ĠLI R
res ult
Ġe s
Ġd s
f or
Ġs b
ne g
Ġru iseki
Ġcol ors
Ġassert IO
ve l
j k
p ow
it ion
Ġa v
Ġt l
Ġscore s
Ġ ST
ad d
c an
M A
3 2
Ġc ity
Ġl t
Ġgy aku
Ġy y
ri end
Ġfi eld
Ġt s
Ġm on
I T
Ġd o
Ġk aijo
Ġsw ap
Ġd am
Ġb lock
Ġt od
di ce
ne w
Ġa x
b a
t est
su b
m an
Ġ/ =
E S
Ġe l
ip y
Ġsc ipy
Ġstat ic
Ġs n
Ġp o
s k
u u
Ġstatic method
Ġro und
O K
Ġp ut
Ġo ver
et a
o ck
Ġg r
Ġsi eve
Ġty p
Ġd at
Ġc ap
ke y
Ġsele ction
ge st
Ġf n
jk stra
i g
Ġinsert ion
: )
Ġs ol
ak o
mat rix
n er
Ġcon ne
t ack
Ġl abel
ĠS S
str ing
ĠF ind
Ġha lf
Ġd ate
Ġsum s
ent er
ab s
Ġr un
Ġr ot
Ġp print
ĠS UM
Ġbi g
Ġs k
Ġb r
Ġho ge
Ġp in
Ġn h
Ġd t
g raph
Ġre ach
ĠS tring
Ġun it
p ath
co mb
Ġseg func
Ġinput s
Ġar y
h a
Ġmo ji
line s
te mp
A B
Ġmap int
ok i
Ġinv s
li ce
ut f
Ġx or
Ġex p
Ġk a
Ġcheck ed
e k
ĠS um
ic s
Ġs ide
Ġarg v
t otal
Ġi r
ord er
Ġst ock
col or
T ree
Ġo bj
Ġf riend
Ġinf o
a f
Ġl ink
id th
b ase
d le
Ġp q
Ġdi jkstra
factor ize
Ġn f
Ġt ak
Ġmax imum
Ġr n
Ġfl ush
b it
Ġv is
g o
ĠMa x
k aijo
Ġstd err
D i
Ġp f
Ġk ou
Ġqu it
ĠString IO
li p
c al
Ġ old
as k
Ġ| =
Ġco in
Ġcombin ation
Ġheappush pop
w ard
st ance
ĠL LI
Ġfac inv
f ill
Ġa ct
Ġpar t
ĠY ES
F S
ell man
ri ce
ch eck
f it
Ġt d
Ġword s
in stance
ĠA A
Ġco u
:* >'
Ġx l
e ger
Ġk i
Ġxy z
M I
Ġin int
Ġco nd
ok o
ist ics
Ġk k
Ġac os
an t
Ġfac es
Ġma sk
Ġz fill
Ġne i
p s
Ġr m
is h
Ġbo mb
Ġstat istics
Ġle vel
i es
p air
S um
num s
Ġget List
Ġr t
y o
Ġs at
ge n
Ġlm i
l g
Ġ on
in ation
Ġas in
Ġc enter
Ġh h
:( >'
Ġ J
Ġc b
Ġt rain
ĠI n
Ġi l
Ġs ur
Ġan y
Ġk w
I n
Ġr ate
Ġw arshall
Ġsum A
ul l
g le
ĠI R
Ġm b
Ġp ush
al ue
Ġis instance
Ġmed ian
Ġmerge Sort
Ġh ist
Ġm ult
Ġv ar
ĠD I
u d
mp ty
ĠD i
I P
v isit
Ġnum ba
Ġfactor s
f t
Ġi c
:* >"
ĠQ ueue
ĠZ IP
dist ance
Ġdi r
ac c
s ame
Ġw idth
di git
Ġnj it
Ġd w
Ġt ask
i o
Ġl et
Ġmin v
ver t
flo yd
ĠCo mb
f i
m ul
Ġb un
Ġmax v
ex p
Ġth eta
t ree
Ġj j
Ġd h
Ġb a
Ġb s
Ġxy h
Ġc n
Ġflo yd
ing o
Ġin m
Ġb us
w arshall
ar se
ĠL C
Ġta ro
Ġsh ell
Ġct r
h e
ĠB C
me mbers
si ble
p rice
n ow
Ġid e
Ġsh ort
P rime
n n
Ġi o
t op
ar g
da y
Ġi pt
Ġlist s
Ġmar k
Ġdam age
ĠA C
ĠC O
Ġ ~
Ġsp arse
w ise
Ġk ind
00 2
MA X
Ġtod o
a li
o st
ĠN O
Ġh ash
Ġty pe
C D
u ke
Ġn t
Ġx v
Ġh s
Ġc ase
Ġin l
: =
Ġr c
Ġe at
Ġm t
Ġdel ta
C ount
Ġab cd
Ġw v
Ġp e
Ġl on
ri dge
Ġpi v
wit ch
